m5stack/uiflow-micropython/m5stack/boards/M5STACK_Unit_PoEP4/mpconfigboard.h
/*
 * SPDX-FileCopyrightText: 2025 M5Stack Technology CO LTD
 *
 * SPDX-License-Identifier: MIT
 */

#ifndef MICROPY_HW_BOARD_NAME
    #define MICROPY_HW_BOARD_NAME "M5STACK Unit PoEP4"
#endif

#ifndef MICROPY_HW_MCU_NAME
    #define MICROPY_HW_MCU_NAME "ESP32P4"
#endif
#define MICROPY_HW_BOARD_NAME "M5STACK Unit PoEP4"

#define MICROPY_HW_ENABLE_USBDEV (0)
#define MICROPY_PY_ESPNOW        (0)
#define MICROPY_PY_BLUETOOTH     (0)
#define MICROPY_PY_NETWORK_LAN   (1)